app/controllers/students_controller.rb

  def update
    @student = Student.update(post_params(:first_name, :last_name))
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-01-24 17:10:57.720483"], ["id", 1]]